EuphonistiHack/marble-maze/TivaWare_c_Series-1.0/examples/boards/ek-tm4c123gxl-boostxl-senshub/maze_receiver/lprf.c
}

//*****************************************************************************
//
// Based on desired restoration setting, configure the RNP parameters for this
// application.
//
//*****************************************************************************
void
ZIDConfigParams(void)
{
    uint8_t pui8Value[MAX_AVAIL_DEVICE_TYPES];
    volatile uint8_t ui8Status;
    uint8_t ui8Tmp;

    g_ui8Sending = 0;
    UARTprintf("start config\n");

    //
    // Button state at system reset will determine how we restore or clear
    // the RNP state and pairing information.
    //
#if 0
    switch(g_ui8Buttons & ALL_BUTTONS)
    {
        //
        // Right button is pressed at startup.
        //
        case RIGHT_BUTTON:
        {
            //
            // Set ui8 to completely clear all configuration and state data
            // from the RNP.
            //
            pui8Value[0] = eRTI_CLEAR_CONFIG_CLEAR_STATE;
            break;
        }

        //
        // Left button is pressed at startup
        //
        case LEFT_BUTTON:
        {
            //
            // Clear just the state information. Configuration is kept.
            //
            pui8Value[0] = eRTI_CLEAR_STATE;
            break;
        }

        //
        // some other button or lack of button press operation was present at
        // startup.
        //
        default:
        {
            //
            // Restore all state and configuration
            //
            pui8Value[0] = eRTI_RESTORE_STATE;
            break;
        }
    }
#endif
    pui8Value[0] = eRTI_CLEAR_STATE;

    //
    // Execute the desired startup control setting. Clears or restore based on
    // button status.
    //
    ui8Status = RTI_WriteItem(RTI_CP_ITEM_STARTUP_CTRL, 1, pui8Value);
    if(ui8Status != RTI_SUCCESS)
    {
    	UARTprintf("Err init: wr startup ctrl\n");
    }

    //
    // If we successfully read the startup control value and it is not set to
    // restore the previous state then we need to re-configure the RNP.
    // If we are set to RESTORE then we can skip this configuration section.
    //
    if((ui8Status == RTI_SUCCESS)  && (pui8Value[0] != eRTI_RESTORE_STATE))
    {
        ui8Status = RTI_WriteItem(RTI_CP_ITEM_NODE_SUPPORTED_TGT_TYPES,
                                 RTI_MAX_NUM_SUPPORTED_TGT_TYPES,
                                 pucTargetList);
        if(ui8Status != RTI_SUCCESS)
        {
        	UARTprintf("Err init: wr supp tgt types\n");
        }

        //
        // Application capabilities is a bit field that the application must
        // configure. It defines number of devices and profiles that this
        // node will be presenting to the network.
        //
        ui8Tmp = 0x12;
        ui8Status = RTI_WriteItem( RTI_CP_ITEM_APPL_CAPABILITIES, 1, &ui8Tmp);
        if (ui8Status != RTI_SUCCESS)
        {
        	UARTprintf("Err init: wr appl cap\n");
        }

        //
        // Write the list of supported device types to the RNP
        //
        ui8Status = RTI_WriteItem(RTI_CP_ITEM_APPL_DEV_TYPE_LIST,
                                 RTI_MAX_NUM_DEV_TYPES, pui8DevList);
        if(ui8Status != RTI_SUCCESS)
        {
        	UARTprintf("Err init: wr dev type list\n");
        }

        //
        // Write the list of supported profiles to the RNP.
        //
        ui8Status = RTI_WriteItem(RTI_CP_ITEM_APPL_PROFILE_ID_LIST,
                                 RTI_MAX_NUM_PROFILE_IDS, pui8ProfileList);
        if(ui8Status != RTI_SUCCESS)
        {
        	UARTprintf("Err init: wr supp prof types\n");
        }

        //
        // Node capabilities is a bit field that controls security, power
        // and other node characteristics.
        //
#ifdef DEV_IS_CONTROLLER
        ui8Tmp = 0x06;
#else
        ui8Tmp = 0x07;
#endif
        ui8Status = RTI_WriteItem(RTI_CP_ITEM_NODE_CAPABILITIES, 1, &ui8Tmp);
        if(ui8Status != RTI_SUCCESS)
        {
        	UARTprintf("Err init: wr node caps\n");
        }

        //
        // Write the Vendor ID number to the RNP.
        //
        pui8Value[0] = (uint8_t) (RTI_VENDOR_TEXAS_INSTRUMENTS & 0xFF);
        pui8Value[1] = (uint8_t) ((RTI_VENDOR_TEXAS_INSTRUMENTS >> 8) & 0xFF);
        ui8Status = RTI_WriteItem(RTI_CP_ITEM_VENDOR_ID, 2, pui8Value);
        if(ui8Status != RTI_SUCCESS)
        {
        	UARTprintf("Err init: wr vendor ID\n");
        }

        ui8Status = RTI_ReadItem(RTI_CP_ITEM_VENDOR_ID, 2, pui8Value);
        if(ui8Status == RTI_SUCCESS )
        {
            UARTprintf("Vendor ID: %d,%d\n", pui8Value[0], pui8Value[1]);
        }
        else
        {
        	UARTprintf("Err reading vendor ID!\n");
        }

        //
        // Write the string version of vendor name to the RNP.
        //
        ui8Status = RTI_WriteItem(RTI_CP_ITEM_VENDOR_NAME,
                                 sizeof(pui8VendorName), pui8VendorName);
        if(ui8Status != RTI_SUCCESS)
        {
        	UARTprintf("Err init: wr vendor name\n");
        }

        ui8Status = RTI_ReadItem(RTI_CP_ITEM_VENDOR_ID, 2, pui8Value);
		if(ui8Status == RTI_SUCCESS )
		{
			UARTprintf("aVendor ID: %d,%d\n", pui8Value[0], pui8Value[1]);
		}
		else
		{
			UARTprintf("Err reading vendor ID!\n");
		}

        //
        // Write the desired standby duty cycle to the RNP.
        //
        pui8Value[0] = (uint8_t) (1000 & 0xFF);
        pui8Value[1] = (uint8_t) (1000 >> 8);
        ui8Status = RTI_WriteItem(RTI_CP_ITEM_STDBY_DEFAULT_DUTY_CYCLE, 2,
                                 pui8Value);
        if(ui8Status != RTI_SUCCESS)
        {
        	UARTprintf("Err init: wr stdby duty cycle\n");
        }
        ui8Status = RTI_ReadItem(RTI_CP_ITEM_VENDOR_ID, 2, pui8Value);
		if(ui8Status == RTI_SUCCESS )
		{
			UARTprintf("bVendor ID: %d,%d\n", pui8Value[0], pui8Value[1]);
		}
		else
		{
			UARTprintf("Err reading vendor ID!\n");
		}
        UARTprintf("All conf written\n");
    }

    UARTprintf("end config\n");
}

//*****************************************************************************
//
// this routine is for the case where the RC boots, and there already are
// pairing table entries, so which target does the RC pair with? This routine
// finds the last pairing entry that is valid.
//
// Note that this logic of selection is not very useful
// when the pairing table size is huge.
//
//*****************************************************************************
static unsigned char
ZIDSelectInitialTargetDevice(void)
{
    uint8_t ui8ReadStatus;
    uint8_t ui8ActiveEntries;

    //
    // Initialize the pairing index to invalid and assume by default we have
    // no active pairing table entries.
    //
    g_ui8LinkDestIndex = RTI_INVALID_PAIRING_REF;
    ui8ActiveEntries = 0;

    //
    // Read the number of active pairing entries.
    //
    ui8ReadStatus = RTI_ReadItemEx(RTI_PROFILE_RTI,
                                  RTI_SA_ITEM_PT_NUMBER_OF_ACTIVE_ENTRIES, 1,
                                  &ui8ActiveEntries);

    //
    // Determine if read was successful and their are active pairing entries
    // present.
    //
    if((ui8ReadStatus == RTI_SUCCESS) && (ui8ActiveEntries != 0))
    {
        //
        // Set the Current LinkDestIndex to the most recent active entry.
        //
        g_ui8LinkDestIndex = ui8ActiveEntries - 1;
        g_vui8LinkState = LINK_STATE_READY;
        RTI_WriteItemEx(RTI_PROFILE_RTI, RTI_SA_ITEM_PT_CURRENT_ENTRY_INDEX, 1,
                            &g_ui8LinkDestIndex);
    }
    return(g_ui8LinkDestIndex);
}

