EuphonistiHack/marble-maze/TivaWare_c_Series-1.0/examples/boards/ek-tm4c123gxl-boostxl-senshub/maze_receiver/lprf.c
#if 0
//*****************************************************************************
//
// Get a ZID report.  This is used when the other side of network sends us
// a report.  Currently we don't use this for anything.  It could be used for
// maintaining light status for things like CAPS LOCK across several keyboards.
//
//*****************************************************************************
static void
ZIDGetReport(uint8_t ui8SrcIndex, uint8_t *pui8Data)
{
    //
    // Do Nothing.
    //
    (void) ui8SrcIndex;
    (void) pui8Data;
}
#endif

//*****************************************************************************
//
// RTI Confirm function. Confirms the receipt of an Init Request (RTI_InitReq).
//
// Called by RTI_AsynchMsgProcess which we have placed in the main application
// context.
//
//*****************************************************************************
void
RTI_InitCnf(uint8_t ui8Status)
{
    uint8_t ui8MaxEntries, ui8DestIndex, ui8Value;
	uint8_t pui8Value[MAX_AVAIL_DEVICE_TYPES];

    ui8Status = RTI_ReadItem(RTI_CP_ITEM_VENDOR_ID, 2, pui8Value);
	if(ui8Status == RTI_SUCCESS )
	{
		UARTprintf("1Vendor ID: %d,%d\n", pui8Value[0], pui8Value[1]);
	}
	else
	{
		UARTprintf("Err reading vendor ID!\n");
	}

    UARTprintf("init hit cnf\n");
    //
    // Verify return status.
    //
    if (ui8Status == RTI_SUCCESS)
    {
        //
        // Make sure startup control is now set back to RESTORE mode.
        //
        ui8Value = eRTI_RESTORE_STATE;
        ui8Status = RTI_WriteItem(RTI_CP_ITEM_STARTUP_CTRL, 1, &ui8Value);
        if(ui8Status != RTI_SUCCESS)
        {
        	UARTprintf("write startupctrl fail\n");
        }

        ui8Status = RTI_ReadItem(RTI_CP_ITEM_VENDOR_ID, 2, pui8Value);
		if(ui8Status == RTI_SUCCESS )
		{
			UARTprintf("2Vendor ID: %d,%d\n", pui8Value[0], pui8Value[1]);
		}
		else
		{
			UARTprintf("Err reading vendor ID!\n");
		}
        //
        // Determine the maximum number of pairing table entries.
        //
        ui8Status = RTI_ReadItemEx(RTI_PROFILE_RTI,
                                  RTI_CONST_ITEM_MAX_PAIRING_TABLE_ENTRIES,
                                  1, &ui8MaxEntries);
        if(ui8Status != RTI_SUCCESS)
        {
        	UARTprintf("read max table entries fail\n");
        }

        //
        // Verify that read was successful.
        //
        if(ui8Status == RTI_SUCCESS)
        {
            //
            // Select initial target device type currently, this routine finds
            // the first pairing entry index, if one exists. If a valid entry
            // is found this function will set the global LinkDestIndex,
            // link state and send an RTI command to write back the current
            // active pairing entry.
            //
            //ui8DestIndex = ZIDSelectInitialTargetDevice();
            //if(ui8DestIndex == RTI_INVALID_PAIRING_REF)
            //{
                //
                // A valid pairing index was not found.
                // Delay briefly so we don't overrun the RPI buffers.
                //
                ROM_SysCtlDelay(ROM_SysCtlClockGet() / (100*3));

                //
                // Send a Disable Sleep Request.  This will wake up the RPI
                // and then start a pairing sequence.
                //
                RTI_DisableSleepReq();

                //
                // Set the link state to pairing in process
                //
                g_vui8LinkState = LINK_STATE_PAIR;
                g_ui32RGBLPRFBlinkCounter = g_ui32SysTickCount;

            //}
#if 0
            else
            {
                //
                // Turn on the LED to show we paired and ready.
                //
                g_pui32RGBColors[GREEN] = 0x4000;
                RGBColorSet(g_pui32RGBColors);
            }
#endif
        }
    }
    else
    {
    	UARTprintf("Err!  initcnf called w/o succes: 0x%02x\n", ui8Status);
    }

}

//*****************************************************************************
//
// RTI confirm function. Called by RTI_AsynchMsgProcess when a pairing
// request is confirmed.  Contains the status of the pairing attempt and
// if successful the destination index.
//
//*****************************************************************************
void
RTI_PairCnf(uint8_t ui8Status, uint8_t ui8DestIndex,
            uint8_t ui8DevType)
{
    //
    // The maze side uses AllowPairReq, not InitPairReq, as it is the target in
    // this case.  As such, PairReq shouldn't be called, so paircnf does nada
    //
#ifdef DEV_IS_CONTROLLER

    static uint8_t sui8Tx[8];
    uint8_t ui8TXOptions = 0;
    //
    // Determine if the Pair attempt was successful.
    //
    if(ui8Status == RTI_SUCCESS)
    {
    	UARTprintf("paired!\n");
        //
        // Save the destination index we got back from our successful pairing.
        // Write that value back to the RNP so it knows this is the current
        // link to be used.
        //
        g_ui8LinkDestIndex = ui8DestIndex;
        ui8Status = RTI_WriteItemEx(RTI_PROFILE_RTI,
                                    RTI_SA_ITEM_PT_CURRENT_ENTRY_INDEX, 1,
                                    &g_ui8LinkDestIndex);

        //
        // Turn on the LED to show we paired and ready.
        //
        g_pui32RGBColors[GREEN] = 0x0;
        RGBColorSet(g_pui32RGBColors);

        sui8Tx[0] = 'h';

        RTI_SendDataReq(g_ui8LinkDestIndex, RTI_PROFILE_ZRC,
						RTI_VENDOR_TEXAS_INSTRUMENTS, ui8TXOptions,
						1, sui8Tx);

    }

    else
    {
    	UARTprintf("tried to pair, failed: 0x%02x\n", ui8Status);
        //
        // Turn off the LED to show pairing failed.
        //
        g_pui32RGBColors[GREEN] = 0;
        RGBColorSet(g_pui32RGBColors);
    }

    g_vui8LinkState = LINK_STATE_READY;
#endif
}

//*****************************************************************************
//
// RTI Confirm function. Called by RTI_AsynchMsgProcess if pairing was aborted.
// Currently not expected to get this call so just set the link state back to
// ready.
//
//*****************************************************************************
void
RTI_PairAbortCnf(uint8_t ui8Status)
{
    (void) ui8Status;

    //
    // Reset the link state.
    //
    if (LINK_STATE_PAIR == g_vui8LinkState)
    {
        g_vui8LinkState = LINK_STATE_READY;
    }
}

//*****************************************************************************
//
// RTI Confirm function. Called by RTI_AsynchMsgProcess when an allow pair
// request is recieved by the application processor.  This is not expected for
// this application.
//
//*****************************************************************************
void
RTI_AllowPairCnf(uint8_t ui8Status, uint8_t ui8DestIndex,
                 uint8_t ui8DevType)
{
    //
    // Do nothing. Controller does not trigger AllowPairReq() and hence is not
    // expecting this callback.
    //
    (void) ui8Status;


