EuphonistiHack/marble-maze/TivaWare_c_Series-1.0/examples/boards/ek-tm4c123gxl-boostxl-senshub/maze_receiver/lprf.c
#ifdef DEV_IS_TARGET
    //
    // For maze_host, we are the target, so our pairing callback is
    // AllowPairCnf, not PairCnf.
    //

	//
	// Determine if the Pair attempt was successful.
	//
	if(ui8Status == RTI_SUCCESS)
	{
	UARTprintf("paired!\n");
	   //
	   // Save the destination index we got back from our successful pairing.
	   // Write that value back to the RNP so it knows this is the current
	   // link to be used.
	   //
	   g_ui8LinkDestIndex = ui8DestIndex;
	   ui8Status = RTI_WriteItemEx(RTI_PROFILE_RTI,
								   RTI_SA_ITEM_PT_CURRENT_ENTRY_INDEX, 1,
								   &g_ui8LinkDestIndex);

	   //
	   // Turn on the LED to show we paired and ready.
	   //
	   g_pui32RGBColors[GREEN] = 0x4000;
	   RGBColorSet(g_pui32RGBColors);
	}

	else
	{
	UARTprintf("tried to pair, failed: 0x%02x\n", ui8Status);
	   //
	   // Turn off the LED to show pairing failed.
	   //
	   g_pui32RGBColors[GREEN] = 0;
	   RGBColorSet(g_pui32RGBColors);
	}

	g_vui8LinkState = LINK_STATE_READY;
#endif
}

//*****************************************************************************
//
// RTI Confirm function.  Called by RTI_AsyncMsgProcess when a unpair request
// is confirmed by the RNP. Currently not implemented.
//
//*****************************************************************************
void
RTI_UnpairCnf(uint8_t ui8Status, uint8_t ui8DestIndex)
{
    //
    // unused arguments
    //
    (void) ui8Status;
    (void) ui8DestIndex;
}

//*****************************************************************************
//
// RTI indication function. Called by RTI_AsynchMsgProcess when the far side of
// the link is requesting to unpair. Currently not implemented.
//
//
//*****************************************************************************
void
RTI_UnpairInd(uint8_t ui8DestIndex)
{

    //
    // unused arguments
    //
    (void) ui8DestIndex;
}

//*****************************************************************************
//
// RTI Confirm function. Called by RTI_AsynchMsgProcess when a data send is
// confirmed. It is now clear to queue the next data packet.
//
//*****************************************************************************
void
RTI_SendDataCnf(uint8_t ui8Status)
{
    //
    // Set the link state to ready.
    //
    if (g_vui8LinkState == LINK_STATE_NDATA)
    {
        g_vui8LinkState = LINK_STATE_READY;
    }

    //
    // Turn on the LED to show we are back to ready state.
    //
    g_pui32RGBColors[GREEN] = 0;
    RGBColorSet(g_pui32RGBColors);
    g_ui8Sending = 0;
}

//*****************************************************************************
//
// RTI Confirm function. Called by RTI_AsynchMsgProcess when the RxEnable
// request has been processed by the RNP. Not implemented.
//
//*****************************************************************************
void
RTI_RxEnableCnf(uint8_t ui8Status)
{
    //
    // Do nothing
    //
    (void) ui8Status;

}

//*****************************************************************************
//
// RTI Confirm function. Called by RTI_AsynchMsgProcess when the enable sleep
// request has been proccessed by the RNP.
//
//*****************************************************************************
void
RTI_EnableSleepCnf(uint8_t ui8Status)
{
    //
    // Do nothing
    //
    (void) ui8Status;
}

//*****************************************************************************
//
// RTI Confirm function. Called by RTI_AsynchMsgProcess when disable sleep
// request has been processed by the RNP. This is used during the init sequence
// as a trigger to start a pairing sequence if needed.
//
//*****************************************************************************
void
RTI_DisableSleepCnf(uint8_t ui8Status)
{
	uint8_t pui8Value[MAX_AVAIL_DEVICE_TYPES];
    (void) ui8Status;

    ui8Status = RTI_ReadItem(RTI_CP_ITEM_VENDOR_ID, 2, pui8Value);
	if(ui8Status == RTI_SUCCESS )
	{
		UARTprintf("3Vendor ID: %d,%d\n", pui8Value[0], pui8Value[1]);
	}
	else
	{
		UARTprintf("Err reading vendor ID!\n");
	}

    //
    // RNP is now awake, if we don't have a pairing link then start the pair
    // process.
    //
    if(g_ui8LinkDestIndex == RTI_INVALID_PAIRING_REF)
    {
#ifdef DEV_IS_CONTROLLER
    	UARTprintf("hitting PairReq\n");
		RTI_PairReq();
#else
    	UARTprintf("hitting AllowPairReq\n");
        RTI_AllowPairReq();
#endif
    }
}

//*****************************************************************************
//
// RTI Confirm function. Called by RTI_AsynchMsgProcess when the RNP would
// like to get the latest report data from the application processor.
//
//*****************************************************************************
void
RTI_ReceiveDataInd(uint8_t ui8SrcIndex, uint8_t ui8ProfileId,
                   uint16_t ui16VendorID, uint8_t ui8RXLinkQuality,
                   uint8_t ui8RXFlags, uint8_t ui8Length, uint8_t *pui8Data)
{

#ifdef DEV_IS_CONTROLLER
#if 0
    static int16_t i16RPYData[3];

    MotionGetRPY(i16RPYData, i16RPYData+1, i16RPYData+2);

    if(pui8Data[0] == 0xA5)
    {
    	UARTprintf("Ack\n");
    	i16RPYData[0] = 0x1234;
    	RTI_SendDataReq(g_ui8LinkDestIndex, RTI_PROFILE_ZRC,
						RTI_VENDOR_TEXAS_INSTRUMENTS, ui8TXOptions, 2,//6,
						(uint8_t *)i16RPYData);
    }
#endif
#else
    int16_t i16Roll, i16Pitch;

    if(ui8Length < 17)
    {
    	UARTprintf("len error!\n");
    }
    //i16Roll = pui8Data[0] | (pui8Data[1] << 8);
    //i16Pitch =pui8Data[2] | (pui8Data[3] << 8);
    i16Roll = strtol(pui8Data, NULL, 10);
    i16Pitch = strtol(pui8Data+6, NULL, 10);

    g_fDeltaX = ((float)i16Roll/(float)1200);
    g_fDeltaY = ((float)i16Pitch/(float)1800);

    g_ui16XWidth = 3750 + (-1 * g_fDeltaX * 1250);
    g_ui16YWidth = 3750 + (g_fDeltaY * 1250);
#if 0
    if(g_fDeltaY > 1.0)
    {
    	g_fDeltaY = 1.0;
    }
    else if(g_fDeltaY > -1.0)
    {
    	g_fDeltaY = -1.0;
    }
#endif
    //i16Yaw = pui8Data[4] | (pui8Data[5] << 8);

    //UARTprintf("Roll: %4d, Pitch: %4d, Yaw: %4d\r", i16Roll/10, i16Pitch/10, i16Yaw/10);
    UARTprintf("RX: %s", pui8Data);
    UARTprintf("Roll: %5d, Pitch: %5d\r", i16Roll/10, i16Pitch/10);

#endif
}

//*****************************************************************************
//
// RTI Confirm function. Called by RTI_AsynchMsgProcess when a standby request
// has been processed by the RNP.
//
//*****************************************************************************
void
RTI_StandbyCnf(uint8_t ui8Status)
{

    (void) ui8Status;

